{
    "card_1": "Coming into this course, I thought I already had a deep appreciation for film. My involvement was mostly driven by entertainment; I prioritized keeping up with new releases, formed strong opinions around the annual Oscars, and judged a film’s quality by its critical praise, how much it \"wowed\" me visually, or the strength of its acting. For me, a \"good\" movie was essentially a successful narrative package.",
    "card_2": "This course, however, has fundamentally shifted my perspective from being a passive consumer of spectacle to an active reader of the frame, revealing a layer of depth I hadn't realized I was missing. The most profound shift in my thinking centers on the technical craft, particularly our discussions on mise-en-scène. I used to dismiss technical analysis as something overly academic or pretentious, but I now understand it as the key to deeper enjoyment.",
    "card_3": "This change was cemented when we revisited a film I had seen before, In the Mood for Love. On my initial viewing, I found elements like the repeated use of certain music cues repetitive and some of the camera work to be clumsy or constrained. After our lectures and activities, I understood how deliberate every element truly was. The way the director utilizes shadows, frames characters through doorways, or relies on the vibrant patterns of the wallpaper isn’t merely set dressing—it is a non-verbal narrative. I realized that the perceived constraints, like a crowded frame or a repeated score, were tools used to direct the viewer’s attention toward the emotional tension and sense of yearning between the characters. Recognizing this intentionality has transformed my appreciation of film, proving that the technicality doesn't detract from the experience but rather amplifies the emotional and thematic payoff.",
    "card_4": "This new analytical lens has also profoundly influenced my understanding of the world itself. I now recognize that nearly every film we watched functions as a social commentary. This was especially true when exploring world cinema. Watching films from cultures outside my own has not just been an academic exercise, but a source of essential education. Where I once might have seen cultural differences as abstract concepts, films have provided tangible, lived experiences—offering lessons about societal structures, historical struggles, and universal human truths that transcend geographical boundaries. It has challenged me to look deeper than the plot to find the ethical, political, and cultural subtext embedded within the storytelling, and I now approach viewing with a sense of curiosity, knowing there is always a layer of meaning waiting to be uncovered.",
    "card_5": "Moving forward, I can see how the critical skills I’ve gained here will apply directly to other aspects of my life. Academically, the close-reading skills developed in breaking down a scene will be invaluable in my literature and history courses, allowing me to treat texts and historical documents with the same careful attention I now pay to cinematography. Personally, I find myself watching all visual media—from documentaries and news reports to social media videos—with a more critical, discerning eye. I am less likely to accept images at face value and more inclined to question the intent, framing, and context behind what is being presented. This course hasn't just taught me how to watch movies; it’s taught me how to read the world around me.",
    "card_6": "Thank you for guiding us through this material."
}